Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driver_licensing/categories_of_motor_vehicles_and_minimum_age_of_drivers_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Categories of motor vehicles and minimum age of drivers
ga: Catagóirí na mótarfheithiclí agus íos-aois na dtiománaithe

source: Motor vehicles in Ireland are divided into different categories for driver licensing purposes
ga: Tá mótarfheithiclí in Éirinn roinnte i gcatagóirí éagsúla i gcomhair ceadúnú tiománaithe

source: This is a standard practice throughout the European Union
ga: Is é seo an gnáthchleachtas ar fud an Aontais Eorpaigh

source: Each category of vehicle has a prescribed minimum age for the driver
ga: Tá aois íosta leagtha síos do thiománaí gach catagóir feithicle

source: In other words, before you can apply for a licence to drive a vehicle in Ireland, you must be a certain age
ga: I bhfocail eile, sular féidir leat iarratas a dhéanamh ar cheadúnas chun feithicil a thiomáint in Éirinn, ní mór duit aois áirithe a bheith agat

source: When you apply for your driving licence or a learner permit, the categories of vehicles you are authorised to drive/operate are listed on your licence
ga: Nuair a dhéanann tú iarratas ar cheadúnas tiomána nó ar chead foghlaimeora, tá na catagóirí feithiclí a bhfuil tú údaraithe a thiomáint/a fheidhmiú liostaithe ar do cheadúnas

source: It is a serious offence to drive any vehicle for which you do not have a licence
ga: Is cion tromchúiseach atá ann aon fheithicil a thiomáint nach bhfuil ceadúnas agat dó

source: On 19 January 2013 Directive 2006/126/EC (as amended) on driving licences came into effect
ga: Ar an 19 Eanáir 2013 tháinig Treoir 2006/126/CE (arna leasú) maidir le ceadúnais tiomána i bhfeidhm

source: This increased the number of vehicle categories from 14 to 15 and the minimum age requirement for certain categories was also changed
ga: Mhéadaigh sin líon na catagóirí feithiclí ó 14 catagóirí go 15 catagóirí agus an riachtanas aois íosta le haghaidh catagóirí áirithe a bhí athrú freisin

source: Further information on the various driving licence changes is available on the Road Safety Authority's website
ga: Tá tuilleadh eolais ar na hathruithe cheadúnas tiomána ar an láithreán gréasáin an Údaráis um Shábháilteacht ar Bhóithre

source: Whether you have a driving licence or a learner permit, you are only entitled to drive the category of vehicle for which the licence or permit has been issued
ga: Bíodh is gur ceadúnas tiomána nó cead foghlaimeora atá agat, níl tú i dteideal ach an chatagóir feithicle a thiomáint dár eisíodh an ceadúnas nó cead foghlaimeora

source: If you wish to have another category of motor vehicle added to your existing driving licence or learner permit, your existing licence/permit must be in date
ga: Más mian leat catagóir eile de mhótarfheithicil a chur leis an gceadúnas tiomána nó ceadúnas foghlaimeora atá agat faoi láthair, ní mór don cheadúnas atá agat faoi láthair a bheith bailí fós

source: Certain categories of vehicles may be added to your existing learner permit without the requirement of submitting a driver theory test certificate
ga: Is féidir catagóirí áirithe feithiclí a chur le do chead foghlaimeora reatha gan aon ghá a bheith le tástáil teoirice tiomána

source: To add other categories, it does involve a driver theory test
ga: Teastaíonn tástáil teoirice tiomána chun catagóirí eile a chur leis

source: Since 19 January 2013, the categories and driver’s minimum age for motorcycles and mopeds are as follows:
ga: Ó 19 Eanáir 2013 seo mar a leanas na catagóirí do ghluaisrothair agus móipéidí agus aois íosta an tiománaí

source: Motorcycle and moped categories from 19 January 2013
ga: Catagóirí gluaisrothair agus móipéidí ó 19 Eanáir 2013

source: │Category│Vehicle type │Minimum age of driver │
ga: │Catagóir│Cineál feithicle │Aois íosta an tiománaí │

source: │AM │Mopeds and tricycles with a maximum speed of 45kph and light quadricycles │16 years │
ga: │AM │Móipéidí agus trírothaigh le luas uasta 45kph agus cuadrothair éadrom │16 bliana d’aois │

source: │A1 │Motorcycles (with or without a sidecar) of 11kW or less and 125cc or less, with a maximum power/weight ratio of 0.1 kW/kg, and motor tricycles of 15 kW or less │16 years │
ga: │A1 │Gluaisrothair (le nó gan carr cliathánach) 11kW nó níos lú agus 125cc nó níos lú, le cóimheas uasta cumhachta / meáchain de 0.1 kW / kg, agus trírothaigh mótair de 15 kW nó níos lú │16 bliana d’aois │

source: │A2 │Motorcycles (with or without a sidecar) of 35kW or less, with a maximum power/weight ratio of 0.2 kW/kg, and not derived from a vehicle of more than double its power │18 years │
ga: │A2 │Gluaisrothair (le nó gan carr cliathánach) 35kW nó níos lú, le cóimheas uasta cumhachta / meáchain de 0.2 kW / kg, agus níl sé díorthaithe ó fheithicil a chumhacht níos mó ná dúbailt │18 bliana d’aois │

source: │A │Motorcycles (with or without a sidecar) and motor tricycles │24 years (20 years via progressive access) │
ga: │A │Gluaisrothair (le nó gan carr cliathánach) agus trírothaigh mótair │24 bliana d’aois (20 bliana d’aois trí rochtain forásach) │

source: Before 19 January 2013 the categories and driver’s minimum age for motorcycles and mopeds were as follows:
ga: Roimh 19 Eanáir 2013 bhí na catagóirí do ghluaisrothair agus móipéidí, agus aois íosta an tiománaí seo mar a leanas

source: Motorcycle and moped categories before 19 January 2013
ga: │ Catagóirí gluaisrothair agus móipéidí roimh 19 Eanáir 2013 │

source: │Category│Vehicle type │Minimum age of │ │ │ │driver │
ga: │Catagóir │Cineál feithicle │Aois íosta an tiománaí │

source: │A1 │Motorcycles of 11kW or less and 125cc or less, with or │16 years │
ga: │A1 │Gluaisrothair suas le 11kW nó 125cc le nó gan taobhcharr │16 bliana d’aois │

source: │A* │Motorcycles with or without a sidecar │18 years │
ga: │A* │Gluaisrothair le nó gan taobhcharr │18 mbliana d’aois │

source: │M │Mopeds with a maximum speed of 45kph and an engine size │16 years │ │ │of 50cc or less │ │
ga: │M │Móipéidí le huas-luasteorainn de 45ksu agus inneall suas le 50cc │16 bliana d’aois │

source: *Learner permits for category A were restricted to motorcycles of 25kW or less
ga: *Tá ceadúnais foghlaimeora do chatagóir A srianta do ghluaisrothair suas le 25kW (timpeall 285cc)

source: This restriction continued for two years after obtaining your first driving licence for category A
ga: Tá an srian seo i bhfeidhm ar feadh dhá bhliain tar éis duit do chéad cheadúnas tiomána do chatagóir A a fháil

source: This restriction still applies to learner permits and driving licences issued before 19 January 2013
ga: Baineann an srian seo fós le ceadanna foghlaimeora agus ceadúnais tiomána a eisíodh roimh 19 Eanáir, 2013

source: Further information is available in our documents on learner driver permits for motorcycles and driving licences for motorcycles
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad maidir le ceadúnais tiomána foghlaimeora do ghluaisrothair agus ceadúnais tiomána do ghluaisrothair

source: Cars and work vehicles
ga: Carranna agus feithiclí oibre

source: The categories and driver’s minimum age for cars and work vehicles are as follows:
ga: Seo mar a leanas na catagóirí do charranna agus do fheithiclí oibre agus aois íosta an tiománaí:

source: │Category│Vehicle type │age of │ │ │ │driver │
ga: │Catagóir│Cineál feithicle │Aois íosta an tiománaí │

source: │ │Vehicles with seats for a maximum of 8 passengers and a maximum │17 │ │B │weight of 3,500kg (can tow a trailer where the maximum weight of │years │ │ │the trailer when fully loaded is 750kg or less) │ │
ga: │B │Feithiclí le suíocháin i gcomhair suas le 8 paisinéir agus uas-mheáchan de 3,500kg (a chuimsíonn leantóir a tharraingt sa chás nach dtéann uas-mheáchan an leantóra thar 750kg nuair atá sé lódáilte go hiomlán) │17 mbliana d’aois │

source: │W │Work vehicles with or without a trailer, such as a land tractor or│16 │ │ │JCB │years │
ga: │W │Feithiclí oibre a bhfuil nó nach bhfuil leantóir acu, cosúil le tarracóir talún nó JCB │16 bliana d’aois │

source: Learner permits for category B do not allow you to pull a trailer
ga: Ní cheadaíonn ceadúnais foghlaimeora do chatagóir B duit leantóir a tharraingt

source: Further information is available in our documents on learner driver permits for cars and work vehicles and driving licences
ga: Tá tuilleadh eolais ar fáil inár ndoiciméid maidir le ceadúnais tiomána foghlaimeora do charranna agus do fheithiclí oibre agus ceadúnais tiomána

source: Since 19 January 2013 the categories and driver’s minimum age for buses and trucks are as follows:
ga: Ó 19 Eanáir 2013 seo mar a leanas na catagóirí do bhusanna agus trucailí agus aois íosta an tiománaí:

source: Bus and truck categories from 19 January 2013
ga: Catagóirí busanna agus trucailí ó 19 Eanáir 2013

source: │Category │Vehicle type │Minimum age of driver │
ga: │Catagóir│Cineál feithicle │Aois íosta an tiománaí │

source: │C1 │Goods vehicles between 3,500kg and 7,500kg │18 years │
ga: │C1 │Feithicil earraí idir 3,500kg agus 7,500kg │18 mbliana d’aois │

source: │C │Goods vehicles over 3,500kg │21 years (18 years with a Driver Certificate of Professional Competance) │
ga: │C │Feithiclí earraí os cionn 3,500kg │21mbliana d’aois (18 mbliana d’aois le Deimhniú ar Inniúlacht Ghairmiúil Tiománaí) │

source: │D1 │Passenger vehicles with accommodation for more than 8 and a maximum of 16 people │21 years │
ga: │D1 │Feithiclí paisinéirí le cóiríocht do níos mó ná ochtar agus suas le 16 duine. │21 mbliana d’aois │

source: │D │Passenger vehicles with accommodation for more than 8 people │24 years (21 years with a Driver Certificate of Professional Competance) │
ga: │D │Feithiclí paisinéirí le cóiríocht do níos mó ná ochtar. │24 mbliana d’aois (21 mbliana d’aois le Deimhniú ar Inniúlacht Ghairmiúil Tiománaí) │

source: Before 19 January 2013 the categories and driver’s minimum age for buses and trucks were as follows:
ga: Roimh 19 Eanáir 2013 bhí na catagóirí do bhusanna agus trucailí, agus aois íosta an tiománaí seo mar a leanas:

source: Bus and truck categories before 19 January 2013
ga: │ Catagóirí busanna agus trucailí roimh 19 Eanáir 2013 │

source: │C │Goods vehicles over 3,500kg │18 years │
ga: │C │Feithiclí earraí os cionn 3,500kg │18 mbliana d’aois │

source: │D1 │Passenger vehicles with accommodation for more than 8 and │21 years │ │ │a maximum of 16 people │ │
ga: │D1 │Feithiclí paisinéirí le cóiríocht do níos mó ná ochtar agus suas le 16 duine. │21 bliain d’aois │

source: │D │Passenger vehicles with accommodation for more than 8 │21 years │
ga: │D │Feithiclí paisinéirí le cóiríocht do níos mó ná ochtar

source: The categories include pulling a trailer where the maximum weight of the trailer when fully loaded is 750kg or less
ga: Cuimsíonn na catagóirí seo leantóir a tharraingt sa chás nach dtéann uas-mheáchan an leantóra thar 750kg nuair atá sé lódáilte go hiomlán

source: However, learner permits for these categories do not allow you to pull a trailer
ga: Ní cheadaíonn ceadúnais foghlaimeora na gcatagóirí seo duit leantóir a tharraingt, áfach

source: Further information is available in our documents on learner driver permits for buses and trucks and driving licences
ga: Tá tuilleadh eolais ar fáil inár ndoiciméid maidir le ceadúnais tiomána foghlaimeora do bhusanna agus trucailí agus ceadúnais tiomána

source: Since 19 January 2013 the categories and minimum age of the driver that apply to a driver pulling a trailer, which has a maximum weight greater than 750kg when fully loaded, are as follows:
ga: Ó 19 Eanáir 2013 seo mar a leanas na catagóirí agus aois íosta an tiománaí a bhaineann le tiománaí atá ag tarraingt leantóir, le huasmheáchan níos airde ná 750kg nuair atá sé lódáilte go hiomlán:

source: Trailer categories from 19 January 2013
ga: Catagóirí leantóirí ó 19 Eanáir 2013

source: │BE │Vehicles in category B with a trailer of 3,500kg maximum weight │17 years │
ga: │BE │Feithiclí i gcatagóir B le leantóir de 3,500kg uasmheáchan │17 mbliana d’aois │

source: │ │Goods vehicles in category C1 where the combined weight of vehicle and trailer when fully loaded is not more than 12,000kg │ │
ga: │ │Feithiclí earraí i gcatagóir C1 sa chás nach an meáchan comhcheangailte na feithicle agus an leantóra nuair atá sé lódáilte go hiomlán níos mó ná 12,000 kg │ │

source: │C1E │ │18 years │
ga: │C1E │ │18 mbliana d’aois │

source: │ │Vehicles in category B with a trailer of over 3,500kg and where the combined weight of vehicle and trailer when fully loaded is not more than 12,000kg, │ │
ga: │ │Feithiclí i gcatagóir B le leantóir níos mó ná 3,500 kg agus i gcás nach bhfuil an meáchan comhcheangailte na feithicle agus an leantóra nuair atá sé lódáilte go hiomlán níos mó ná 12,000 kg │ │

source: │CE │Goods vehicles in category C with a trailer (includes articulated trucks) │21 years (18 years with a Driver Certificate of Professional Competance) │
ga: │CE │Feithiclí earraí i gcatagóir C le leantóir (áirítear leis seo trucailí altacha) │21 mbliana d’aois (18 mbliana d’aois le Deimhniú ar Inniúlacht Ghairmiúil Tiománaí) │

source: │D1E │Passenger vehicles in category D1 with a trailer │21 years │
ga: │D1E │Feithiclí paisinéirí i gcatagóir D1 le leantóir │21 mbliana d’aois │

source: │DE │Passenger vehicles in category D with a trailer │24 years (21 years with a Driver Certificate of Professional Competance) │
ga: │DE │Feithiclí paisinéirí i gcatagóir D le leantóir │24 mbliana d’aois (21 mbliana d’aois le Deimhniú ar Inniúlacht Ghairmiúil Tiománaí) │

source: Before 19 January 2013 the categories and minimum age of the driver that applied to a driver pulling a trailer were as follows:
ga: Roimh 19 Eanáir 2013 bhí seo mar a leanas na catagóirí agus aois íosta an tiománaí a bhaineann le tiománaí atá ag tarraingt leantóir, le huasmheáchan níos airde ná 750kg nuair atá sé lódáilte go hiomlán:

source: Trailer categories before 19 January 2013
ga: │ Catagóirí leantóirí roimh 19 Eanáir 2013 │

source: │ │ │Minimum│ │Category│Vehicle type │age of │
ga: │Catagóir│Cineál feithicle │Aois íosta an tiománaí │

source: │EB │Vehicles in category B with a trailer │17 │
ga: │EB │Feithiclí i gcatagóir B le leantóir │17 mbliana d’aois │

source: ├────────┼──────────────────────────────────────────────────────────────────┼───────┤ │ │Goods vehicles in category C1 where the combined weight of vehicle│18 │ │EC1 │and trailer when fully loaded is not more than 12,000kg, and the │years │
ga: │EC1 │Feithiclí earraí i gcatagóir C1 sa chás nach bhfuil meáchan iomlán na feithicle agus an leantóra agus é lódáilte go hiomlán, os cionn 12,000kg, agus nach bhfuil an leantóir níos troime ná an fheithicil earraí folamh nuair atá sé lódáilte go hiomlán │18 mbliana d’aois │

source: │EC │Goods vehicles in category C with a trailer (includes articulated │18 │
ga: │EC │Feithiclí earraí i gcatagóir C le leantóir (cuimsíonn sé seo trucail altacha) │18 mbliana d’aois │

source: │ED │Passenger vehicles in category D with a trailer │21 │ │ │ │years │
ga: │ED │Feithiclí paisinéirí i gcatagóir D le leantóir │21 bliain d’aois │

source: Further information is available in our documents on learner driver permits for trailers and driving licences
ga: Tá tuilleadh eolais ar fáil inár ndoiciméid maidir le ceadúnais tiomána foghlaimeora do leantóirí agus ceadúnais tiomána
